timdoug/cyd_clock/sdkconfig.defaults
# ESP32 Target
CONFIG_IDF_TARGET="esp32"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# LWIP
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# NVS
CONFIG_NVS_ENCRYPTION=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# SPI RAM (CYD doesn't have PSRAM, disable)
CONFIG_SPIRAM=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
